app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def show
    @course.pv +=1
    @course.save
    @usrs = User.find(current_user.id)
    @charts = Rating.find_or_create_by(courseid: params[:id])
    @comments = Comment.new
    @mess = Comment.where(courseid: params[:id])
---
UPDATE `courses` SET `pv` = 1, `updated_at` = '2017-05-16 03:45:23' WHERE `courses`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `ratings` (`courseid`, `created_at`, `updated_at`) VALUES (1, '2017-05-14 21:12:54', '2017-05-14 21:12:54')
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`courseid` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`courseid` = 3

  def rate
    @ratings = Rating.find_or_create_by(courseid: params[:id])
    @ratings.vote +=1
    @ratings.teacher += params[:rating][:teacher].to_i
    @ratings.courserate += params[:rating][:courserate].to_i
    @ratings.easy += params[:rating][:easy].to_i
    @ratings.attendance += params[:rating][:attendance].to_i
    @ratings.homework += params[:rating][:homework].to_i


    @usrs = User.find(current_user.id)
    unless @usrs.ratedclass.blank?
      @ratedornot = @usrs.ratedclass.split("#").find{ |ids| ids.to_i ==   params[:id].to_i }
    end
    @usrs.ratedclass = @usrs.ratedclass.to_s + params[:id]  + '#'

    if @ratedornot.blank? then
      @ratings.save
      @usrs.save
---
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`courseid` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `ratings` SET `vote` = 1, `teacher` = 5, `courserate` = 2, `easy` = 5, `attendance` = 2, `homework` = 3, `updated_at` = '2017-05-16 22:27:08' WHERE `ratings`.`id` = 2
UPDATE `users` SET `ratedclass` = '1#', `updated_at` = '2017-05-15 04:58:04' WHERE `users`.`id` = 1

  def comm
    unless params[:comment][:message].blank? then
      ccc = Comment.new
      ccc.courseid = params[:id].to_i
      ccc.usersid = current_user.id
      ccc.message = params[:comment][:message]
      ccc.year = params[:comment][:year]
      ccc.typos = params[:comment][:typos]
      ccc.bycommented = Course.find(params[:id]).pv.to_i

      ccc.save


      @usrs = User.find(current_user.id)
      @usrs.commentedclass = @usrs.commentedclass.to_s + params[:id] + '#'
      @usrs.commentedid = @usrs.commentedid.to_s  + Comment.count.to_s + '#'
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `comments` (`courseid`, `usersid`, `message`, `typos`, `bycommented`, `created_at`, `updated_at`) VALUES (3, 1, '日本語でコメントした場合の長さで\r\n開業もしてみたらどうなるのかというとテスト\r\n愛うえfじゃdふぁfげwgrげg', 2, 116, '2017-05-17 18:56:17', '2017-05-17 18:56:17')
UPDATE `users` SET `commentedclass` = '1#', `commentedid` = '0#', `bycommented` = '7#', `updated_at` = '2017-05-16 04:00:25' WHERE `users`.`id` = 1
SELECT COUNT(*) FROM `comments`

  def vote
    vvv = Comment.find(params[:id])
    if params[:gorb] == "g"
      vvv.goods += 1
    else
      vvv.bads += 1
    end
    @usrs = User.find(current_user.id)

    if @usrs.votedclass.blank?
      @votedornot = []
    else
      @votedornot = @usrs.votedcomid.to_s.split("#")
    end

    @usrs.votedcomid = @usrs.votedcomid.to_s + params[:id]  + '#'

    if @votedornot.find{ |ids| ids.to_i ==   params[:id].to_i }.blank?
      vvv.save
      @usrs.save
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `comments` SET `goods` = 1, `updated_at` = '2017-05-15 06:00:28' WHERE `comments`.`id` = 1
UPDATE `users` SET `votedcomid` = '1#', `updated_at` = '2017-05-15 06:00:28' WHERE `users`.`id` = 1

  def like
    @usrs = User.find(current_user.id)

    unless @usrs.likedclass.blank?
      @likedornot = @usrs.likedclass.split("#").find{ |ids| ids.to_i ==   params[:id].to_i }
    else
      @likedornot ={}
    end

    if @likedornot.blank?
      @usrs.likedclass = @usrs.likedclass.to_s + params[:id]  + '#'
      @usrs.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `likedclass` = '1#', `updated_at` = '2017-05-16 04:55:03' WHERE `users`.`id` = 1

  def dislike
    @usrs = User.find(current_user.id)



    @usrs.likedclass = ("#" + @usrs.likedclass).gsub("#"+params[:id].to_s+"#", "#")
    @usrs.likedclass.slice!(0)
    @usrs.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
UPDATE `users` SET `likedclass` = '#', `updated_at` = '2017-05-16 13:06:09' WHERE `users`.`id` = 1

  def create
    @course = Course.new(course_params)
    @course.creator = current_user.id
    respond_to do |format|
      if @course.save
        @usrs = User.find(current_user.id)
        @usrs.createdclass = @usrs.createdclass.to_s + Course.count.to_s+ '#'
        @usrs.save
---
INSERT INTO `courses` (`coursename`, `teacher`, `credits`, `duration`, `weekday`, `code`, `dept`, `creator`, `created_at`, `updated_at`) VALUES ('マクロ経済学', '二上なんとか', 2, '前期', '月1', '11111', '経済', 1, '2017-05-16 03:45:23', '2017-05-16 03:45:23')
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `courses`
UPDATE `users` SET `createdclass` = '5#', `updated_at` = '2017-05-16 06:04:33' WHERE `users`.`id` = 1

    def set_course
      @course = Course.find(params[:id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 3 LIMIT 1