app/views/mypage/result.html.haml

  - @res.each do |a|
    - rats = Rating.find_by(courseid:a.id)
---
SELECT  `ratings`.* FROM `ratings` WHERE `ratings`.`courseid` = 4 LIMIT 1